app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "hows your life going ?"], ["created_at", "2022-02-10 16:30:32.350126"], ["updated_at", "2022-02-10 16:30:32.350126"], ["user_id", 1]]
---
	def create
		message = current_user.messages.build(message_params)
		if message.save